InformationRegisters/ПисьмаСодержание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ПисьмаСодержание</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сигнатура</Name>
					<Comment>MessageID почтового сообщения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>170</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Письма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>Письма</Name>
			<Comment>Почтовые сообщения</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Comment>Дата и время прочтения писмьма приложением</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Comment>Регион внешнего абонента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Страны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Comment>Имя интернет-ресурса нашей компании, с которого было отправлено письмо или адрес отправителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентВнешний</Name>
					<Comment>Телефон внешнего абонента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Comment>Дата отправки письма</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователяПочтовогоЯщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Свойство1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сигнатура</Name>
					<Comment>MessageID почтового сообщения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>170</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПисьмаСодержание/Forms/ФормаЗаписиЧтение/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	

	Доступно = 		ЗначениеЗаполнено(ЭтаФорма.Параметры.Сигнатура)
				И 	ТипЗнч(ЭтаФорма.Параметры.Сигнатура) = Тип ("Строка");
	  Если Не Доступно Тогда
		Сообщить("Ошибка в переданной сигнатуре");
		Возврат
	КонецЕсли;
	
	//Найди полную сигнатуру на случай, если передана обрезанная сигнатура
	Запрос = Новый Запрос("ВЫБРАТЬ Письма.Сигнатура ИЗ РегистрСведений.Письма КАК Письма ГДЕ Письма.Сигнатура ПОДОБНО &Сигнатура");
	Запрос.УстановитьПараметр("Сигнатура", "%"+СокрЛП(Параметры.Сигнатура)+"%");
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Сообщить("Не найдено письмо по сигнатуре "+Параметры.Сигнатура);
		Отказ = Истина;
	КонецЕсли;
	Сигн = РезультатЗапроса.Выгрузить()[0][0];

		Если Доступно Тогда
		НЗ = РегистрыСведений.ПисьмаСодержание.СоздатьМенеджерЗаписи();
		НЗ.Сигнатура = Сигн;
		НЗ.Прочитать();
		Если НЗ.Выбран() Тогда
			ЭтаФорма.Сигнатура 	= НЗ.Сигнатура;
			
			// Выбери закладку для отображения
			Если СтрНайти(НЗ.Содержание, "html")>1 Тогда
				ЭтаФорма.Элементы.Группа1.ТекущаяСтраница = ЭтаФорма.Элементы.HTML;	
			Иначе
				ЭтаФорма.Элементы.Группа1.ТекущаяСтраница = ЭтаФорма.Элементы.Текст;
			КонецЕсли;
			
			// Безусловно добавь в содержание письма теги <html> и </html>. Даже если они уже есть отображение все равно будет корректным
			ЭтаФорма.СодержаниеHTML = "<html>"+НЗ.Содержание+"</html>";
			ЭтаФорма.СодержаниеТекст = НЗ.Содержание;
		Иначе
			Сообщить("ошибка");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Переслать(Команда)
	
	//Получи параметры ИмяПользователяПочтовогоЯщика, Отправитель, ДатаОтправления из РС.Письма
	ИмяПользователяПочтовогоЯщика = "";
	Отправитель = "";
	ДатаОтправления = "";
	Рез = ПараметрыПисьмаПолучи(ИмяПользователяПочтовогоЯщика, Отправитель, ДатаОтправления, Сигнатура); 
	Если Рез = Ложь Тогда
		Сообщить("Не получены параметры письма");
		Возврат;
	КонецЕсли;
	
	//Получи письмо как объект 
	Письмо = ЭлПочтаКлиентСервер.ПисьмоНайти(Сигнатура, ИмяПользователяПочтовогоЯщика, Отправитель, ДатаОтправления);
	
	//Открой форму пересылки письма
	ЭлПочтаКлиент.ПисьмоПереслать(Письмо, "ekc@luidor.ru");
КонецПроцедуры

&НаСервере
Функция ПараметрыПисьмаПолучи (ИмяПользователяПочтовогоЯщика, Отправитель, ДатаОтправления, MessageID)
	//Находит письмо в регистре Письма и возвращает ИмяПользователяПочтовогоЯщика, Отправитель, ДатаОтправления)
	
	Доступно = 		ТипЗнч(MessageID) = Тип("Строка")
				И 	ЗначениеЗаполнено(MessageID);			
	Если Не Доступно Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|		Т.ДатаОтправки КАК ДатаОтправки,
	|		Т.АдресОтправителя КАК АдресОтправителя,
	|		Т.ИмяПользователяПочтовогоЯщика КАК ИмяПользователяПочтовогоЯщика
	|ИЗ 	РегистрСведений.Письма КАК Т
	|ГДЕ	Т.Сигнатура = &Сигнатура";
	Запрос.УстановитьПараметр("Сигнатура", MessageID);
	РезЗапроса = Запрос.Выполнить();
	Если РезЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	Выборка = РезЗапроса.Выбрать();
	Выборка.Следующий();
	ИмяПользователяПочтовогоЯщика 	= Выборка.ИмяПользователяПочтовогоЯщика;
	Отправитель 					= Выборка.АдресОтправителя;
	ДатаОтправления 				= Выборка.ДатаОтправки;
	Возврат Истина;
КонецФункции
